Revit 2026 API

# PaperSourceSetErase Method

---

Removes a specified object from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	PaperSource item
)
```
```vb
Public Overridable Function Erase (
	item As PaperSource
) As Integer
```
```cpp
public:
virtual int Erase(
	PaperSource^ item
)
```
```fsharp
abstract Erase :
        item : PaperSource -> int
override Erase :
        item : PaperSource -> int
```

#### Parameters

item PaperSource
    The item to be erased.

#### Return Value

Int32The number of items that were erased from the set.

#### Reference

PaperSourceSet Class

Autodesk.Revit.DB Namespace